output/posts/pdftk/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>pdftk: The PDF Toolkit | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/pdftk/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../early-history-of-bosonization/" title="Early History of Bosonization" type="text/html">
<link rel="next" href="../git/" title="git" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="pdftk: The PDF Toolkit">
<meta property="og:url" content="https://chimez.github.io/posts/pdftk/">
<meta property="og:description" content="添加目录与修改元信息


参见： https://www.pdflabs.com/blog/export-and-import-pdf-bookmarks/



从pdf中提取目录和元信息

   pdftk C:\Users\Sid\Desktop\doc.pdf dump_data output C:\Users\Sid\Desktop\doc_data.txt





给pdf添加或更新">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-01-08T11:09:45+08:00">
<meta property="article:tag" content="linux">
<meta property="article:tag" content="pdf">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">pdftk: The PDF Toolkit</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-01-08T11:09:45+08:00" itemprop="datePublished" title="2021-01-08 11:09">2021-01-08 11:09</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org5348be7" class="outline-2">
<h2 id="org5348be7">添加目录与修改元信息</h2>
<div class="outline-text-2" id="text-org5348be7">
<p>
参见： <a href="https://www.pdflabs.com/blog/export-and-import-pdf-bookmarks/">https://www.pdflabs.com/blog/export-and-import-pdf-bookmarks/</a>
</p>
</div>
<div id="outline-container-orgc8e36be" class="outline-3">
<h3 id="orgc8e36be">从pdf中提取目录和元信息</h3>
<div class="outline-text-3" id="text-orgc8e36be">
<div class="highlight"><pre><span></span>   pdftk C:\Users\Sid\Desktop\doc.pdf dump_data output C:\Users\Sid\Desktop\doc_data.txt
</pre></div>
</div>
</div>

<div id="outline-container-org72a8cbe" class="outline-3">
<h3 id="org72a8cbe">给pdf添加或更新目录</h3>
<div class="outline-text-3" id="text-org72a8cbe">
<div class="highlight"><pre><span></span>   pdftk C:\Users\Sid\Desktop\doc.pdf update_info C:\Users\Sid\Desktop\doc_data.txt output C:\Users\Sid\Desktop\updated.pdf
</pre></div>

<p>
目录文件格式：
</p>
<div class="highlight"><pre><span></span>   BookmarkBegin
   BookmarkTitle: PDF Reference (Version 1.5)
   BookmarkLevel: 1
   BookmarkPageNumber: 1
   BookmarkBegin
   BookmarkTitle: Contents
   BookmarkLevel: 2
   BookmarkPageNumber: 3
</pre></div>

<p>
其中字符应编码成 html entitle 的样子。
可以用 <a href="https://tool.oschina.net/encode">https://tool.oschina.net/encode</a> , <a href="https://www.online-toolz.com/tools/unicode-html-entities-convertor.php">https://www.online-toolz.com/tools/unicode-html-entities-convertor.php</a> 这里的 Native/Unicode 转换工具。
</p>

<p>
或者python
</p>
<div class="highlight"><pre><span></span>   <span class="sa">u</span><span class="s2">"阿斯顿"</span><span class="o">.</span><span class="n">encode</span><span class="p">(</span><span class="s1">'ascii'</span><span class="p">,</span> <span class="s1">'xmlcharrefreplace'</span><span class="p">)</span>

   <span class="k">def</span> <span class="nf">utf8_to_ascii_xml</span><span class="p">(</span><span class="n">filename</span><span class="p">):</span>
       <span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="n">filename</span><span class="p">,</span><span class="s1">'r'</span><span class="p">,</span><span class="n">encoding</span><span class="o">=</span><span class="s1">'utf-8'</span><span class="p">)</span> <span class="k">as</span> <span class="n">fi</span><span class="p">:</span>
	   <span class="n">lines</span> <span class="o">=</span> <span class="n">fi</span><span class="o">.</span><span class="n">readlines</span><span class="p">()</span>
	   <span class="n">lines_ascii</span> <span class="o">=</span> <span class="p">[</span><span class="n">x</span><span class="o">.</span><span class="n">encode</span><span class="p">(</span><span class="s1">'ascii'</span><span class="p">,</span> <span class="s1">'xmlcharrefreplace'</span><span class="p">)</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">lines</span><span class="p">]</span>
       <span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="sa">f</span><span class="s2">"</span><span class="si">{</span><span class="n">filename</span><span class="si">}</span><span class="s2">.ascii"</span><span class="p">,</span> <span class="s1">'wb'</span><span class="p">)</span> <span class="k">as</span> <span class="n">fi</span><span class="p">:</span>
	   <span class="n">fi</span><span class="o">.</span><span class="n">writelines</span><span class="p">(</span><span class="n">lines_ascii</span><span class="p">)</span>
</pre></div>

<p>
常用正则替换
</p>
<pre class="example">
s/\(.*\),\(.*\)/BookmarkBegin\nBookmarkTitle: \1\nBookmarkLevel: 2\nBookmarkPageNumber: \2/
</pre>
</div>
</div>

<div id="outline-container-orgdf63e31" class="outline-3">
<h3 id="orgdf63e31">添加目录的示例流程</h3>
<div class="outline-text-3" id="text-orgdf63e31">
<div class="highlight"><pre><span></span>   <span class="c1"># import</span>
   <span class="kn">import</span> <span class="nn">pytesseract</span>
   <span class="kn">from</span> <span class="nn">PIL</span> <span class="kn">import</span> <span class="n">Image</span>
   <span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
   <span class="kn">import</span> <span class="nn">pandas</span> <span class="k">as</span> <span class="nn">pd</span>
   <span class="kn">import</span> <span class="nn">re</span>

   <span class="c1"># 利用 OCR 生成目录</span>
   <span class="nb">print</span><span class="p">(</span><span class="n">pytesseract</span><span class="o">.</span><span class="n">image_to_string</span><span class="p">(</span><span class="n">Image</span><span class="o">.</span><span class="n">open</span><span class="p">(</span><span class="s1">'a.png'</span><span class="p">)))</span>

   <span class="c1"># 手动编辑目录，使用 orgmode 的表格</span>
   <span class="n">data</span> <span class="o">=</span> <span class="n">pd</span><span class="o">.</span><span class="n">read_csv</span><span class="p">(</span><span class="s2">"a.txt"</span><span class="p">,</span> <span class="n">sep</span><span class="o">=</span><span class="s2">"|"</span><span class="p">)</span>
   <span class="n">darr</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">(</span><span class="n">data</span><span class="p">)</span>
   <span class="n">darr</span><span class="p">[:,</span><span class="mi">1</span><span class="p">]</span> <span class="o">=</span> <span class="p">[</span><span class="n">i</span><span class="o">.</span><span class="n">strip</span><span class="p">()</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="n">darr</span><span class="p">[:,</span><span class="mi">1</span><span class="p">]]</span>
   <span class="n">darr</span><span class="p">[:,</span><span class="mi">2</span><span class="p">]</span> <span class="o">=</span> <span class="p">[</span><span class="n">i</span><span class="o">.</span><span class="n">strip</span><span class="p">()</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="n">darr</span><span class="p">[:,</span><span class="mi">2</span><span class="p">]]</span>
   <span class="n">darr</span><span class="p">[</span><span class="mi">2</span><span class="p">:,</span><span class="mi">3</span><span class="p">]</span> <span class="o">=</span> <span class="n">darr</span><span class="p">[</span><span class="mi">2</span><span class="p">:,</span><span class="mi">3</span><span class="p">]</span><span class="o">+</span><span class="mi">9</span>
   <span class="n">data</span> <span class="o">=</span> <span class="n">pd</span><span class="o">.</span><span class="n">DataFrame</span><span class="p">(</span><span class="n">darr</span><span class="p">[:,</span><span class="mi">1</span><span class="p">:</span><span class="o">-</span><span class="mi">1</span><span class="p">])</span>
   <span class="n">data</span>

   <span class="c1"># 生成目录格式并保存</span>
   <span class="n">block</span> <span class="o">=</span> <span class="s2">"""BookmarkBegin</span>
<span class="s2">   BookmarkTitle: </span><span class="si">{title}</span><span class="s2"></span>
<span class="s2">   BookmarkLevel: </span><span class="si">{level}</span><span class="s2"></span>
<span class="s2">   BookmarkPageNumber: </span><span class="si">{page}</span><span class="s2"></span>
<span class="s2">   """</span>
   <span class="n">txt</span> <span class="o">=</span> <span class="s2">""</span>
   <span class="k">for</span> <span class="n">line</span> <span class="ow">in</span> <span class="n">darr</span><span class="p">:</span>
       <span class="n">index</span> <span class="o">=</span> <span class="n">line</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span>
       <span class="n">title</span> <span class="o">=</span> <span class="n">line</span><span class="p">[</span><span class="mi">2</span><span class="p">]</span>
       <span class="n">page</span> <span class="o">=</span> <span class="n">line</span><span class="p">[</span><span class="mi">3</span><span class="p">]</span>
       <span class="k">if</span> <span class="n">index</span> <span class="o">==</span> <span class="s1">''</span> <span class="ow">or</span> <span class="n">index</span><span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span> <span class="o">==</span> <span class="s1">'.'</span><span class="p">:</span>
	   <span class="n">level</span> <span class="o">=</span> <span class="mi">1</span>
       <span class="k">else</span><span class="p">:</span>
	   <span class="n">level</span> <span class="o">=</span> <span class="mi">2</span>
	   <span class="n">txt</span> <span class="o">+=</span> <span class="n">block</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">title</span><span class="o">=</span><span class="sa">f</span><span class="s2">"</span><span class="si">{</span><span class="n">index</span><span class="si">}</span><span class="s2"> </span><span class="si">{</span><span class="n">title</span><span class="si">}</span><span class="s2">"</span><span class="p">,</span> <span class="n">level</span><span class="o">=</span><span class="n">level</span><span class="p">,</span> <span class="n">page</span><span class="o">=</span><span class="n">page</span><span class="p">)</span>

   <span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="s2">"b.txt"</span><span class="p">,</span><span class="s1">'w'</span><span class="p">)</span> <span class="k">as</span> <span class="n">fi</span><span class="p">:</span>
       <span class="n">fi</span><span class="o">.</span><span class="n">writelines</span><span class="p">(</span><span class="n">txt</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>


<div id="outline-container-org5074803" class="outline-2">
<h2 id="org5074803">合并pdf文件</h2>
<div class="outline-text-2" id="text-org5074803">
<div class="highlight"><pre><span></span>  pdftk in1.pdf in2.pdf cat output out1.pdf
</pre></div>
</div>
</div>


<div id="outline-container-orgec1e89b" class="outline-2">
<h2 id="orgec1e89b">djvu to pdf</h2>
<div class="outline-text-2" id="text-orgec1e89b">
<ol class="org-ol">
<li>djvulibre</li>
</ol>
<div class="highlight"><pre><span></span>  ddjvu -format=pdf -quality=85 -verbose a.djvu a.pdf
</pre></div>
</div>
</div>


<div id="outline-container-org5ad867d" class="outline-2">
<h2 id="org5ad867d">分割文件</h2>
<div class="outline-text-2" id="text-org5ad867d">
<div class="highlight"><pre><span></span>pdftk in.pdf burst output out_%04d.pdf
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/linux/" rel="tag">linux</a></li>
            <li><a class="tag p-category" href="../../categories/pdf/" rel="tag">pdf</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../early-history-of-bosonization/" rel="prev" title="Early History of Bosonization">Previous post</a>
            </li>
            <li class="next">
                <a href="../git/" rel="next" title="git">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
